export const teacherTopics = [
  {
    id: "t-1",
    content: "国家科技部外专项目 DL2023178004L，\"虚拟交互设计与设计思维视域下的一带一路\"，2023-2024，负责人 - 姜可",
  },
  {
    id: "t-2",
    content: "参与国家社科基金重大项目 12&ZD234，\"世界记忆遗产\"东巴经典传承体系数字化国际共享平台建设研究，从事其中东巴文化信息与交互设计研究，2013-2018 - 姜可",
  },
  {
    id: "t-3",
    content: "参与国家社科基金一般项目 10BF055，\"20世纪以来的西方艺术设计理论体系研究\"，从事设计研究，2011-2013 - 姜可",
  },
  {
    id: "t-4",
    content: "参与国家重大专项\"高精度数控闭式静压转台立式圆台磨床研制\"（课题编号：2011ZX04002-062），从事其中工业设计，2010-2015 - 姜可",
  },
  {
    id: "t-5",
    content: "北京市科技计划项目\"ZH5120立式钻铣加工中心外观造型研究和开发设计\"(Z11111005490000)，负责人，2011-2012 - 姜可",
  },
  {
    id: "t-6",
    content: "北京市教委人才强教项目\"工业设计提升数控装备竞争力的关键技术研究\"(PHR201008427)，负责人，2010-2012 - 姜可",
  },
  {
    id: "t-7",
    content: "2025北京理工大学研究生创新基金校级重点项目",
  },
  {
    id: "t-8",
    content: "2026年北京理工大学本科教育教学改革与教学项目",
  },
];
